# -*- coding: utf-8 -*-
"""
Created on Mon Sep 24 03:35:31 2018

@author: SCM80
"""




a="But where is Waldo?"


print(len(a[5:9]))

print(a[4:7])
print(len(a[4:7]))




print("-----我是分隔線1-----")
st="abcdefg"
print("-----本體-----")
print(st)


print("-----我是分隔線1-----")
# 一定是從左邊開始輸出
# 0=左邊第一個定義位置為0
# [起點位置:終點位置-1]
# [a:b],a=起點位置,b-a=取幾個數字,b=終點位置-1
# 起點一定為正整數，終點可為負數
# 位置的標示=a b c d e f g
#         = 0 1 2 3 4 5 6
#         =-7-6-5-4-3-2-1


# 1=輸出到「位置=1-1處」
print(st[0:1])

print("-----我是分隔線2-----")
# -1=輸出到「位置-1-1處」
print(st[0:-1])  #輸出到位置-2
print(st[0:-2])  #輸出到位置-3
print(st[0:-3])  #輸出到位置-4
print(st[0:-4])  #輸出到位置-5
print(st[0:-5])  #輸出到位置-6
print(st[0:-6])  #輸出到位置-7
print(st[0:-7])  #輸出到位置-8?!就印不出來

print("-----我是分隔線3-----")
# 從左邊「字元位置=1」，輸出到「字元位置=3-1處」
print(st[1:3])
print(st[1:3]*2)


print("-----我是分隔線4-----")
# 從左邊「字元位置=3」，輸出到最後
print(st[3:])


print("-----我是分隔線5-----")
print(st[-1:-3])


print("-------------------")
print("---------斜線n=換行，要加在引號之間----------")

print("abc\nabc")

print("---------前面加個r，讓 斜線n 不會換行----------")
print(r"abc\nabc")
